Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_esp32.h
#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_MICROMOD) 
#define FLPROG_CORE_NAME "SparkFun ESP32 MicroMod"
#define FLPROG_CORE_CODE 101
#define FLPROG_CORE_ESP32_MICROMOD
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_PICO) 
#define FLPROG_CORE_NAME "KITS ESP32 EDU, CNRS AW2ETH, Turta IoT Node, ESP32 PICO-D4"
#define FLPROG_CORE_CODE 105
#define FLPROG_CORE_ESP32_PICO
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_POE) 
#define FLPROG_CORE_NAME "OLIMEX ESP32-PoE"
#define FLPROG_CORE_CODE 106
#define FLPROG_CORE_ESP32_POE
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_POE_ISO) 
#define FLPROG_CORE_NAME "OLIMEX ESP32-PoE-ISO"
#define FLPROG_CORE_CODE 107
#define FLPROG_CORE_ESP32_POE_ISO
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_THING) 
#define FLPROG_CORE_NAME "SparkFun ESP32 Thing"
#define FLPROG_CORE_CODE 110
#define FLPROG_CORE_ESP32_THING
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_THING_PLUS) 
#define FLPROG_CORE_NAME "SparkFun ESP32 Thing Plus"
#define FLPROG_CORE_CODE 111
#define FLPROG_CORE_ESP32_THING_PLUS
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_THING_PLUS_C) 
#define FLPROG_CORE_NAME "SparkFun ESP32 Thing Plus C"
#define FLPROG_CORE_CODE 112
#define FLPROG_CORE_ESP32_THING_PLUS_C
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_WROOM_DA) 
#define FLPROG_CORE_NAME "ESP32-WROOM-DA Module"
#define FLPROG_CORE_CODE 113
#define FLPROG_CORE_ESP32_WROOM_DA
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_WROVER_KIT) 
#define FLPROG_CORE_NAME "ESP32 Wrover Kit (all versions)"
#define FLPROG_CORE_CODE 114
#define FLPROG_CORE_ESP32_WROVER_KIT
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESPECTRO32) 
#define FLPROG_CORE_NAME "ESPectro32"
#define FLPROG_CORE_CODE 115
#define FLPROG_CORE_ESPECTRO32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

