Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_esp32.h
#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESPEA32) 
#define FLPROG_CORE_NAME "ESPea32"
#define FLPROG_CORE_CODE 116
#define FLPROG_CORE_ESPEA32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESPINO32) 
#define FLPROG_CORE_NAME "ThaiEasyElec's ESPino32"
#define FLPROG_CORE_CODE 117
#define FLPROG_CORE_ESPINO32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ET_BOARD) 
#define FLPROG_CORE_NAME "ET-Board"
#define FLPROG_CORE_CODE 118
#define FLPROG_CORE_ET_BOARD
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FEATHER_ESP32) 
#define FLPROG_CORE_NAME "Adafruit ESP32 Feather, unPhone 7"
#define FLPROG_CORE_CODE 124
#define FLPROG_CORE_FEATHER_ESP32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FROG_ESP32) 
#define FLPROG_CORE_NAME "Frog Board ESP32"
#define FLPROG_CORE_CODE 127
#define FLPROG_CORE_FROG_ESP32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_HEALTHYPI_4) 
#define FLPROG_CORE_NAME "ProtoCentral HealthyPi 4"
#define FLPROG_CORE_CODE 129
#define FLPROG_CORE_HEALTHYPI_4
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_HONEYLEMON) 
#define FLPROG_CORE_NAME "HONEYLemon"
#define FLPROG_CORE_CODE 130
#define FLPROG_CORE_HONEYLEMON
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_HORNBILL_ESP32_DEV) 
#define FLPROG_CORE_NAME "Hornbill ESP32 Dev"
#define FLPROG_CORE_CODE 131
#define FLPROG_CORE_HORNBILL_ESP32_DEV
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_HORNBILL_ESP32_MINIMA) 
#define FLPROG_CORE_NAME "Hornbill ESP32 Minima"
#define FLPROG_CORE_CODE 132
#define FLPROG_CORE_HORNBILL_ESP32_MINIMA
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_IMBRIOS_LOGSENS_V1P1) 
#define FLPROG_CORE_NAME "IMBRIOS LOGSENS_V1P1"
#define FLPROG_CORE_CODE 133
#define FLPROG_CORE_IMBRIOS_LOGSENS_V1P1
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

