Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_esp32.h
#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_QUANTUM) 
#define FLPROG_CORE_NAME "Noduino Quantum"
#define FLPROG_CORE_CODE 175
#define FLPROG_CORE_QUANTUM
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_SONOFF_DUALR3) 
#define FLPROG_CORE_NAME "Sonoff DUALR3"
#define FLPROG_CORE_CODE 178
#define FLPROG_CORE_SONOFF_DUALR3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TBEAM) 
#define FLPROG_CORE_NAME "T-Beam"
#define FLPROG_CORE_CODE 180
#define FLPROG_CORE_TBEAM
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TINYPICO) 
#define FLPROG_CORE_NAME "UM TinyPICO"
#define FLPROG_CORE_CODE 181
#define FLPROG_CORE_TINYPICO
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TTGO_LORA32) 
#define FLPROG_CORE_NAME "TTGO LoRa32-OLED"
#define FLPROG_CORE_CODE 185
#define FLPROG_CORE_TTGO_LORA32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TTGO_T1) 
#define FLPROG_CORE_NAME "TTGO T1"
#define FLPROG_CORE_CODE 186
#define FLPROG_CORE_TTGO_T1
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TTGO_T7_V13_MINI32) 
#define FLPROG_CORE_NAME "TTGO T7 V13 Mini32"
#define FLPROG_CORE_CODE 187
#define FLPROG_CORE_TTGO_T7_V13_MINI32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TTGO_T7_V14_MINI32) 
#define FLPROG_CORE_NAME "TTGO T7 V14 Mini32"
#define FLPROG_CORE_CODE 188
#define FLPROG_CORE_TTGO_T7_V14_MINI32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TWATCH) 
#define FLPROG_CORE_NAME "TTGO T-Watch"
#define FLPROG_CORE_CODE 189
#define FLPROG_CORE_TWATCH
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TRUEVERIT_ESP32_UNIVERSAL_IOT_DRIVER) 
#define FLPROG_CORE_NAME "Trueverit ESP32 Universal IoT Driver"
#define FLPROG_CORE_CODE 190
#define FLPROG_CORE_TRUEVERIT_ESP32_UNIVERSAL_IOT_DRIVER
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

