Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_esp32.h
#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TRUEVERIT_ESP32_UNIVERSAL_IOT_DRIVER_MK_II) 
#define FLPROG_CORE_NAME "Trueverit ESP32 Universal IoT Driver MK II"
#define FLPROG_CORE_CODE 191
#define FLPROG_CORE_TRUEVERIT_ESP32_UNIVERSAL_IOT_DRIVER_MK_II
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_UBLOX_NINA_W10) 
#define FLPROG_CORE_NAME "u-blox NINA-W10 series (ESP32)"
#define FLPROG_CORE_CODE 192
#define FLPROG_CORE_UBLOX_NINA_W10
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WATCHY) 
#define FLPROG_CORE_NAME "Watchy"
#define FLPROG_CORE_CODE 196
#define FLPROG_CORE_WATCHY
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WESP32) 
#define FLPROG_CORE_NAME "Silicognition wESP32"
#define FLPROG_CORE_CODE 197
#define FLPROG_CORE_WESP32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WIDORA_AIR) 
#define FLPROG_CORE_NAME "Widora AIR"
#define FLPROG_CORE_CODE 198
#define FLPROG_CORE_WIDORA_AIR
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WIPY3) 
#define FLPROG_CORE_NAME "WIPY3"
#define FLPROG_CORE_CODE 199
#define FLPROG_CORE_WIPY3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WT32_ETH01) 
#define FLPROG_CORE_NAME "WT32-ETH01 Ethernet Module"
#define FLPROG_CORE_CODE 200
#define FLPROG_CORE_WT32_ETH01
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WIFIDUINO32) 
#define FLPROG_CORE_NAME "WiFiduino32"
#define FLPROG_CORE_CODE 203
#define FLPROG_CORE_WIFIDUINO32
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_CONNAXIO_ESPOIR) 
#define FLPROG_CORE_NAME "Connaxio's Espoir"
#define FLPROG_CORE_CODE 206
#define FLPROG_CORE_CONNAXIO_ESPOIR
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32VN_IOT_UNO) 
#define FLPROG_CORE_NAME "ESP32vn IoT Uno"
#define FLPROG_CORE_CODE 207
#define FLPROG_CORE_ESP32VN_IOT_UNO
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

