Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_esp32.h
#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_UPESY_WROVER) 
#define FLPROG_CORE_NAME "uPesy ESP32 Wrover DevKit"
#define FLPROG_CORE_CODE 220
#define FLPROG_CORE_UPESY_WROVER
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_BASIC

#define FLPROG_I2C0_SDA 21
#define FLPROG_I2C0_SCL 22
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_QTPY_ESP32C3) 
#define FLPROG_CORE_NAME "Adafruit QT Py ESP32-C3"
#define FLPROG_CORE_CODE 46
#define FLPROG_CORE_ADAFRUIT_QTPY_ESP32C3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_AIRM2M_CORE_ESP32C3) 
#define FLPROG_CORE_NAME "AirM2M_CORE_ESP32C3"
#define FLPROG_CORE_CODE 51
#define FLPROG_CORE_AIRM2M_CORE_ESP32C3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BEE_MOTION_MINI) 
#define FLPROG_CORE_NAME "Bee Motion Mini"
#define FLPROG_CORE_CODE 56
#define FLPROG_CORE_BEE_MOTION_MINI
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DYG) 
#define FLPROG_CORE_NAME "Deneyap Kart G"
#define FLPROG_CORE_CODE 70
#define FLPROG_CORE_DYG
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32C3_DEV) 
#define FLPROG_CORE_NAME "ESP32C3 Dev Module, ESP32C3 DEV"
#define FLPROG_CORE_CODE 76
#define FLPROG_CORE_ESP32C3_DEV
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32C3_M1_I_KIT) 
#define FLPROG_CORE_NAME "ESP-C3-M1-I-Kit"
#define FLPROG_CORE_CODE 77
#define FLPROG_CORE_ESP32C3_M1_I_KIT
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_LOLIN_C3_MINI) 
#define FLPROG_CORE_NAME "LOLIN C3 Mini"
#define FLPROG_CORE_CODE 138
#define FLPROG_CORE_LOLIN_C3_MINI
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TTGO_T_OI_PLUS_DEV) 
#define FLPROG_CORE_NAME "TTGO T-OI PLUS RISC-V ESP32-C3"
#define FLPROG_CORE_CODE 184
#define FLPROG_CORE_TTGO_T_OI_PLUS_DEV
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_VALTRACK_V4_MFW_ESP32_C3) 
#define FLPROG_CORE_NAME "VALTRACK_V4_MFW_ESP32_C3"
#define FLPROG_CORE_CODE 194
#define FLPROG_CORE_VALTRACK_V4_MFW_ESP32_C3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_VALTRACK_V4_VTS_ESP32_C3) 
#define FLPROG_CORE_NAME "VALTRACK_V4_VTS_ESP32_C3"
#define FLPROG_CORE_CODE 195
#define FLPROG_CORE_VALTRACK_V4_VTS_ESP32_C3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WIFIDUINOV2) 
#define FLPROG_CORE_NAME "WiFiduinoV2"
#define FLPROG_CORE_CODE 202
#define FLPROG_CORE_WIFIDUINOV2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_XIAO_ESP32C3) 
#define FLPROG_CORE_NAME "XIAO_ESP32C3"
#define FLPROG_CORE_CODE 204
#define FLPROG_CORE_XIAO_ESP32C3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_C3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S2) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S2"
#define FLPROG_CORE_CODE 37
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S2_REVTFT) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S2 Reverse TFT"
#define FLPROG_CORE_CODE 38
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S2_REVTFT
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S2_TFT) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S2 TFT"
#define FLPROG_CORE_CODE 39
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S2_TFT
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_QTPY_ESP32S2) 
#define FLPROG_CORE_NAME "Adafruit QT Py ESP32-S2"
#define FLPROG_CORE_CODE 47
#define FLPROG_CORE_ADAFRUIT_QTPY_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BEE_MOTION) 
#define FLPROG_CORE_NAME "Bee Motion"
#define FLPROG_CORE_CODE 55
#define FLPROG_CORE_BEE_MOTION
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DEPARTMENT_OF_ALCHEMY_MINIMAIN_ESP32S2) 
#define FLPROG_CORE_NAME "Department of Alchemy MiniMain ESP32-S2"
#define FLPROG_CORE_CODE 64
#define FLPROG_CORE_DEPARTMENT_OF_ALCHEMY_MINIMAIN_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DYM) 
#define FLPROG_CORE_NAME "Deneyap Mini"
#define FLPROG_CORE_CODE 71
#define FLPROG_CORE_DYM
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DYMV2) 
#define FLPROG_CORE_NAME "Deneyap Mini v2"
#define FLPROG_CORE_CODE 72
#define FLPROG_CORE_DYMV2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32S2_DEV) 
#define FLPROG_CORE_NAME "ESP32S2 Dev Module"
#define FLPROG_CORE_CODE 78
#define FLPROG_CORE_ESP32S2_DEV
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32S2_THING_PLUS) 
#define FLPROG_CORE_NAME "SparkFun ESP32-S2 Thing Plus"
#define FLPROG_CORE_CODE 79
#define FLPROG_CORE_ESP32S2_THING_PLUS
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32S2_USB) 
#define FLPROG_CORE_NAME "ESP32S2 Native USB"
#define FLPROG_CORE_CODE 80
#define FLPROG_CORE_ESP32S2_USB
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FEATHERS2) 
#define FLPROG_CORE_NAME "UM FeatherS2"
#define FLPROG_CORE_CODE 120
#define FLPROG_CORE_FEATHERS2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FEATHERS2NEO) 
#define FLPROG_CORE_NAME "UM FeatherS2 Neo"
#define FLPROG_CORE_CODE 121
#define FLPROG_CORE_FEATHERS2NEO
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FRANZININHO_WIFI) 
#define FLPROG_CORE_NAME "Franzininho WiFi"
#define FLPROG_CORE_CODE 125
#define FLPROG_CORE_FRANZININHO_WIFI
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FRANZININHO_WIFI_MSC) 
#define FLPROG_CORE_NAME "Franzininho WiFi MSC"
#define FLPROG_CORE_CODE 126
#define FLPROG_CORE_FRANZININHO_WIFI_MSC
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FUNHOUSE_ESP32S2) 
#define FLPROG_CORE_NAME "Adafruit FunHouse"
#define FLPROG_CORE_CODE 128
#define FLPROG_CORE_FUNHOUSE_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_LOLIN_S2_MINI) 
#define FLPROG_CORE_NAME "LOLIN S2 Mini"
#define FLPROG_CORE_CODE 141
#define FLPROG_CORE_LOLIN_S2_MINI
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_LOLIN_S2_PICO) 
#define FLPROG_CORE_NAME "LOLIN S2 PICO"
#define FLPROG_CORE_CODE 142
#define FLPROG_CORE_LOLIN_S2_PICO
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_MAGTAG29_ESP32S2) 
#define FLPROG_CORE_NAME "MAGTAG29 ESP32S2"
#define FLPROG_CORE_CODE 156
#define FLPROG_CORE_MAGTAG29_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_METRO_ESP32S2) 
#define FLPROG_CORE_NAME "Adafruit Metro ESP32-S2"
#define FLPROG_CORE_CODE 157
#define FLPROG_CORE_METRO_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_MICROS2) 
#define FLPROG_CORE_NAME "microS2"
#define FLPROG_CORE_CODE 162
#define FLPROG_CORE_MICROS2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_RMP) 
#define FLPROG_CORE_NAME "UM RMP"
#define FLPROG_CORE_CODE 177
#define FLPROG_CORE_RMP
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TINYS2) 
#define FLPROG_CORE_NAME "UM TinyS2"
#define FLPROG_CORE_CODE 182
#define FLPROG_CORE_TINYS2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ATMEGAZERO_ESP32S2) 
#define FLPROG_CORE_NAME "ATMegaZero ESP32-S2"
#define FLPROG_CORE_CODE 205
#define FLPROG_CORE_ATMEGAZERO_ESP32S2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S2
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S3) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S3 2MB PSRAM"
#define FLPROG_CORE_CODE 40
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S3_NOPSRAM) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S3 No PSRAM"
#define FLPROG_CORE_CODE 41
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S3_NOPSRAM
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S3_REVTFT) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S3 Reverse TFT"
#define FLPROG_CORE_CODE 42
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S3_REVTFT
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_FEATHER_ESP32S3_TFT) 
#define FLPROG_CORE_NAME "Adafruit Feather ESP32-S3 TFT"
