Totuin/Flprog_Utilites/src/selectCore/flprogSelectCore_esp32.h
#define FLPROG_CORE_CODE 43
#define FLPROG_CORE_ADAFRUIT_FEATHER_ESP32S3_TFT
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ADAFRUIT_QTPY_ESP32S3_NOPSRAM) 
#define FLPROG_CORE_NAME "Adafruit QT Py ESP32-S3 No PSRAM"
#define FLPROG_CORE_CODE 48
#define FLPROG_CORE_ADAFRUIT_QTPY_ESP32S3_NOPSRAM
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BPI_LEAF_S3) 
#define FLPROG_CORE_NAME "BPI-Leaf-S3"
#define FLPROG_CORE_CODE 53
#define FLPROG_CORE_BPI_LEAF_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BEEMOTIONS3) 
#define FLPROG_CORE_NAME "Bee Motion S3"
#define FLPROG_CORE_CODE 54
#define FLPROG_CORE_BEEMOTIONS3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_BEE_S3) 
#define FLPROG_CORE_NAME "Bee S3"
#define FLPROG_CORE_CODE 57
#define FLPROG_CORE_BEE_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_CRABIK_SLOT_ESP32_S3) 
#define FLPROG_CORE_NAME "Crabik Slot ESP32-S3"
#define FLPROG_CORE_CODE 58
#define FLPROG_CORE_CRABIK_SLOT_ESP32_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_CYTRON_MAKER_FEATHER_AIOT_S3) 
#define FLPROG_CORE_NAME "Cytron Maker Feather AIoT S3"
#define FLPROG_CORE_CODE 59
#define FLPROG_CORE_CYTRON_MAKER_FEATHER_AIOT_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_DYDK1AV2) 
#define FLPROG_CORE_NAME "Deneyap Kart 1A v2"
#define FLPROG_CORE_CODE 69
#define FLPROG_CORE_DYDK1AV2
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32S3_CAM_LCD) 
#define FLPROG_CORE_NAME "ESP32S3 CAM LCD"
#define FLPROG_CORE_CODE 81
#define FLPROG_CORE_ESP32S3_CAM_LCD
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32S3_DEV) 
#define FLPROG_CORE_NAME "ESP32S3 Dev Module, ESP32S3 DEV"
#define FLPROG_CORE_CODE 82
#define FLPROG_CORE_ESP32S3_DEV
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_S3_BOX) 
#define FLPROG_CORE_NAME "ESP32-S3-Box"
#define FLPROG_CORE_CODE 108
#define FLPROG_CORE_ESP32_S3_BOX
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_ESP32_S3_USB_OTG) 
#define FLPROG_CORE_NAME "ESP32-S3-USB-OTG"
#define FLPROG_CORE_CODE 109
#define FLPROG_CORE_ESP32_S3_USB_OTG
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_EDGEBOX_ESP_100) 
#define FLPROG_CORE_NAME "Edgebox-ESP-100"
#define FLPROG_CORE_CODE 119
#define FLPROG_CORE_EDGEBOX_ESP_100
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_FEATHERS3) 
#define FLPROG_CORE_NAME "UM FeatherS3"
#define FLPROG_CORE_CODE 122
#define FLPROG_CORE_FEATHERS3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_LILYGO_T_DISPLAY_S3) 
#define FLPROG_CORE_NAME "LilyGo T-Display-S3"
#define FLPROG_CORE_CODE 135
#define FLPROG_CORE_LILYGO_T_DISPLAY_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_LOLIN_S3) 
#define FLPROG_CORE_NAME "LOLIN S3"
#define FLPROG_CORE_CODE 143
#define FLPROG_CORE_LOLIN_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_M5STACK_ATOMS3) 
#define FLPROG_CORE_NAME "M5Stack-ATOMS3"
#define FLPROG_CORE_CODE 151
#define FLPROG_CORE_M5STACK_ATOMS3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_PROS3) 
#define FLPROG_CORE_NAME "UM PROS3"
#define FLPROG_CORE_CODE 170
#define FLPROG_CORE_PROS3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_REDPILL_ESP32S3) 
#define FLPROG_CORE_NAME "RedPill(+) ESP32-S3"
#define FLPROG_CORE_CODE 176
#define FLPROG_CORE_REDPILL_ESP32S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TAMC_TERMOD_S3) 
#define FLPROG_CORE_NAME "TAMC Termod S3"
#define FLPROG_CORE_CODE 179
#define FLPROG_CORE_TAMC_TERMOD_S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_TINYS3) 
#define FLPROG_CORE_NAME "UM TinyS3"
#define FLPROG_CORE_CODE 183
#define FLPROG_CORE_TINYS3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_UBLOX_NORA_W10) 
#define FLPROG_CORE_NAME "u-blox NORA-W10 series (ESP32-S3)"
#define FLPROG_CORE_CODE 193
#define FLPROG_CORE_UBLOX_NORA_W10
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_WIFIDUINO32S3) 
#define FLPROG_CORE_NAME "WiFiduino32S3"
#define FLPROG_CORE_CODE 201
#define FLPROG_CORE_WIFIDUINO32S3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_HELTEC_WIFI_32_LORA_V3) 
#define FLPROG_CORE_NAME "Heltec WiFi LoRa 32(V3) / Wireless shell(V3) / Wireless stick lite (V3)"
#define FLPROG_CORE_CODE 209
#define FLPROG_CORE_HELTEC_WIFI_32_LORA_V3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_HELTEC_WIFI_KIT_32_V3) 
#define FLPROG_CORE_NAME "Heltec WiFi Kit 32(V3)"
#define FLPROG_CORE_CODE 211
#define FLPROG_CORE_HELTEC_WIFI_KIT_32_V3
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_UNPHONE8) 
#define FLPROG_CORE_NAME "unPhone 8"
#define FLPROG_CORE_CODE 221
#define FLPROG_CORE_UNPHONE8
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#if !defined(FLPROG_CORE_CODE) && defined(ARDUINO_UNPHONE9) 
#define FLPROG_CORE_NAME "unPhone 9"
#define FLPROG_CORE_CODE 222
#define FLPROG_CORE_UNPHONE9
#define FLPROG_CORE_ESP                                  
#define FLPROG_CORE_ESP32 
#define FLPROG_I2CSPEED 400000UL
#define FLPROG_HAS_UART0
#define FLPROG_HAS_I2C0
#define FLPROG_HAS_SPI0
#define FLPROG_CORE_ESP32_S3
#endif
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
